Autodesk.Revit.DB.Structure.AnalyticalSupportType
Indicates what kind of support another Element provides -- Point, Surface, or Curve.

Autodesk.Revit.DB.Structure.AnalyticalSupportType.SurfaceSupport
Support along a surface.

Autodesk.Revit.DB.Structure.AnalyticalSupportType.CurveSupport
Support along a curve.

Autodesk.Revit.DB.Structure.AnalyticalSupportType.PointSupport
Support at just one point.

Autodesk.Revit.DB.Structure.AnalyticalSupportType.UnknownSupport
Support has not been determined.